# Задание 3
months = [['январь', 31],
          ['февраль', 28],
          ['март', 31],
          ['апрель', 30] ,
          ['май', 31],
          ['июнь', 30],
          ['июль', 31],
          ['август', 31],
          ['сентябрь', 30],
          ['октябрь', 31],
          ['ноябрь', 30],
          ['декабрь', 31]]
astrology_signs = [['Козерог', 22],
                   ['Водолей',21],
                   ['Рыбы', 19],
                   ['Овен', 20],
                   ['Телец', 20],
                   ['Близнецы', 20],
                   ['Рак', 21],
                   ['Лев', 22],
                   ['Дева', 23],
                   ['Весы', 23,
                   ['Скорпион', 23],
                   ['Стрелец', 22]
month = input('Введите месяц своего рождения: ')
if month in months:
    day = int(input('Ведите день своего рождения: '))
    mindx = months.index(month)
    if (mindx % 2 == 0 and mindx <= 6 and day <= 31) or (mindx % 2 == 0 and mindx > 7 and day <= 30):
        print('Все правильно ввели')
    else:
        print('Дата рождения введена некорректно')
else:
    print('Такого месяца не существует!')