# Задание 1
#phrase_1 = 'Насколько проще было бы писать программы, если бы не заказчики'
#phrase_2 = '640Кб должно хватить для любых задач. Билл Гейтс (по легенде)'
#phrase_1 = '640Кб должно хватить для любых задач. Билл Гейтс (по легенде)'
#phrase_2 = 'Насколько проще было бы писать программы, если бы не заказчики'
phrase_1 = 'Насколько проще было бы писать программы, если бы не заказчики'
phrase_2 = 'Насколько проще было бы писать программы, если бы не заказчики'
if len(phrase_1) > len(phrase_2):
    print('Фраза_1 длиннее Фразы_2')
elif len(phrase_1) < len(phrase_2):
    print('Фраза_1 короче Фразы_2')
else:
    print('Фраза_1 равна (по длине) Фразе_2')

